/*
1) Descreva abaixo sua Requisição ou Incidente:

Olá Paulo,
Tudo bem?

Conforme falamos, preciso que ajuste os meus pedidos de W10, conforme abaixo:

TIPO DE COMPRA: 1ºCOMPRA
FILIAIS
ENTREGAR: CD CAJAMAR W10 (Já está correto)
COBRANÇA: MATRIZ
FATURAR:CDCAJAMAR W10 (Já está correto)


2) Anexe o "Print do Incidente" ou "Formulário de Requisição".
Enviado pelo Teams
*/

select * 
update a set FILIAL_COBRANCA='MATRIZ', TIPO_COMPRA='1ª COMPRA'                
from compras a
where pedido in 
('288156'
,'275743'
,'275750'
,'275757'
,'275758'
,'275942'
,'275957'
,'276218'
,'276249'
,'276250'
,'275829'
,'275830'
,'275850'
,'275853'
,'276101'
,'276108'
,'276109'
,'275969'
,'276034'
,'300216'
,'300218'
,'300220'
,'300221'
,'300222'
,'300224'
,'298616'
,'298635'
,'298637'
,'298638'
,'298640'
,'298642'
,'298643'
,'298644'
,'298646'
,'298649'
,'298651'
,'298652'
,'298653'
,'298654'
,'298655'
,'298658'
,'299550'
,'299562'
,'299564'
,'299565'
,'299566'
,'299569'
,'299573'
,'299574'
,'299575'
,'299577'
,'299578'
,'299579'
,'301579'
,'301580'
,'301581'
,'301582'
,'301583'
,'301584'
,'301585'
,'301586'
,'301587'
,'301057'
,'301050'
,'301051'
,'301052'
,'301053'
,'301054'
,'301055'
,'301030'
,'301031'
,'301032'
,'301034'
,'301035'
,'301036'
,'301040'
,'301041'
,'301043'
,'301044'
,'301046'
,'301047'
,'301038'
,'301048'
,'301049'
,'301169')
